<?php

namespace Fafaker\Providers\Fa;

use Fafaker\Providers\Contracts\Generatable;
use Fafaker\Providers\Contracts\GenerateTrait;

class AddressProvider implements Generatable{

    use GenerateTrait;

    protected static array $storage= [
        'تهران-خیابان ولیعصر-ولیعصر7-کوچه شهید فهمیده-پلاک38' ,
        'تهران-کامرانیه-خیابان امام-خیابان آزادی-کوچه شهید عباسی پلاک9',
        'کرج-بلوار آزادی-آزادی80-کوچه آفتاب3',
        'کرج-میدان صنعت-خیابان شهید رجائی2-کوچه زنبق-پلاک23',
        'تهران-تهرانپارس-میدان امام حسین-خیابان شقایق25-کوچه صداقت-مجتمع مسکونی صدرا-واحد 301',
        'قزوین-میدان بسیج-خیابان آزاده-کوچه شهید احمدذوقی-پلاک83',
        'قم-میدان 72تن-خیابان فرهنگ-کوچه فرهنگ33-پلاک83-طبقه2',
        'ساری-میدان ساعت-خیابان جمهوری-جمهوری43-کوچه شهید کریمی-پلاک 227',
        'رشت-فلکه کشاورز-خیابان رز-رز23-کوچه دوم-پلاک 88'
    ];
}