<?php

namespace Fafaker\Providers\Fa;

use Fafaker\Providers\Contracts\Generatable;
use Fafaker\Providers\Contracts\GenerateTrait;

class FamilyProvider implements Generatable{

    use GenerateTrait;

    protected static array $storage = [
        'دربندی','محمدی','مرادی','مومنی','کریمی','کرمی','عسگری','سعیدی','خلیقی','کارگر','مصطفایی','صفری',
        'شاهماری','کرد','کردی','خضری','خضرپور','نادرپور','نادری','محمودی','قنبری','قادری','صابری','صادقی',
        'جابری','جباری','عبدالهی','نصرتی','نریمانی','ضیغمی','خداداد','خدادادی','خدامرادی','درخشان','درخشانی',
        'دارایی','یاری','شفیعی','نوخاصی','عظیمی','اعظمی','عزتی','صالحی','بشارتی','زنگنه','رجالی','مردانی',
        'رستمی','ویسی','عزیزی','ابراهیمی','اسماعیلی','سلیمی','کامرانی','کامروا','اصفهانی','تهرانی','کلانتری',
        'لشکری','رضایی','علیمحمدی','احمدی','صوفی','صباغ','کریم نژاد','کرمی خواه','صبوری','مهدی پور','ایرانی',
        'ایران نژاد','ناظری','یوسفی','جمالی','جمالزاده','کمالی','کمالزاده','یاسینی','لهراسبی','هوشنگی',
        'ولیزاده' , 'توکلی','توسلی','بیات','طارمی','شجاعی','کریم زاده',
    ];
}