<?php

namespace Fafaker\Providers\Fa;

use Fafaker\Providers\Contracts\Generatable;
use Fafaker\Providers\Contracts\GenerateTrait;

class NameProvider implements Generatable{

    use GenerateTrait;

    /*
     * database of provider
    */
    protected static array $storage = [
        'male'=>[
        'محمد' ,'علی' ,'حسین' ,'حسن' ,'رضا' ,'سجاد' ,'جواد' ,'احسان' ,'ابراهیم' ,'مازیار' ,'مانی' ,
        'نیما' ,'سینا' ,'اشکان' ,'امیرحسین' ,'امیرعلی' ,'امیر' ,'عباس' ,'لقمان' ,'امیرمحمد' ,'امیررضا' ,
        'علیرضا' ,'اکبر' ,'علی اکبر' ,'مراد' ,'علیمراد' ,'عبداالله' ,'خلیل' ,'جلیل' ,'اسماعیل' ,'متین','سعید',
        'آرمین' ,'مهران' ,'احمد' ,'محمود' ,'فرشید' ,'جاسم' ,'جسیم' ,'سعید' ,'کریم' ,'شفیع' ,'جنید' ,'جبار' ,
        'قباد' ,'قادر' ,'جابر' ,'قاسم' ,'آرتا' ,'آبتین' ,'آرش' ,'آریا' ,'ارشیا' ,'اسامه' ,'ارمیا' ,'بردیا' ,
        'ایلیا' ,'بابک' ,'بهداد' ,'بهزاد' ,'باربد' ,'بهنام' ,'پارسا' ,'پدرام' ,'پرهام' ,'برهان' ,'توحید' ,
        'تیام' ,'جاوید' ,'حافظ' ,'حامد' ,'خسرو' ,'مهرداد' ,'دارا' ,'داریوش' ,'دانا' ,'دانیال' ,'رامبد' ,
        'رامتین' ,'رامسین' ,'راشد' ,'رشید' ,'رامین' ,'رایان' ,'روزبه' ,'زاهد' ,'ذکریا' ,'سروش' ,'ساتیار' ,
        'سوشا' ,'سامان' ,'ساسان' ,'ماکان' ,'ماهان' ,'سبحان' ,'سپهر' ,'سورنا' ,'شادمهر' ,'شاهین' ,'شایان' ,
        'شروین' ,'شهاب' ,'شهریار' ,'صابر' ,'صبور' ,'منصور' ,'طاها' ,'طاهر' ,'عادل' ,'عارف' ,'عرفان' ,'عماد' ,
        'عیسی' ,'فاتح' ,'فتاح' ,'فربد' ,'فرید' ,'فرحان' ,'فرزاد' ,'فرداد' ,'فرشاد' ,'فرهام' ,'فواد' ,'قدیر' ,
        'قنبر' ,'قادر' ,'عبدالقادر' ,'کامران' ,'کامیار' ,'کاوه' ,'کسری' ,'کوروش' ,'کوشا' ,'کیارش' ,'کارن' ,
        'کیانوش' ,'کیوان' ,'کیهان' ,'کیان' ,'گلمحمد' ,'لاوان' ,'مهیار' ,'مهداد' ,'مهراب' ,'مزدک' ,'میثاق' ,
        'مهرشاد' ,'میکائیل' ,'محسن' ,'محسون' ,'ماردین' ,'نامی' ,'نصیر' ,'نوید' ,'نبکان' ,'هابیل' ,'هارون' ,
        'هامون' ,'همایون' ,'هومن' ,'حسام' ,'یاسر' ,'یاسین' ,'یزدان' ,'یاشار' ,'یعقوب' ,'یونس' ,'یوسف' ,'ارسلان',
        'اتابک' ,'اصلان' ,'اهورا' ,'صدرا' ,'مسیحا' ,'ماجد' ,'مجید' ,'هیراد' ,'آرین' ,'آریان' ,'آرمان' ,'آرام' ,
        'سام' ,'برسام' ,'آرسین' ,'شایان' ,'سهند' ,'اشکان' ,'شاهرخ' ,'سردار' ,'امید' ,'شریف' ,'نصیر' ,'ناصر' ,
        'پیمان' ,'پیام' ,'پوریا' ,'آزاد' ,'آراد' ,'آرمان' ,'غضنفر' ,'فاضل' ,'فضل الله' ,'افشین' ,'اسفندیار' ,
        'رستم' ,'رهام' ,'کیکاووس' ,'رستم' ,'شهروز' ,'فیروز' ,'پیروز' ,'نامدار' ,'سیامک' ,'سالار' ,'بهنام' ,
        'فردین' ,'بنیامین' ,'انوشیروان' ,'محمدرضا' ,'شاپور' ,'شهباز' ,'فرمند' ,'کاووس' ,'کوشا' ,'هرمز' ,
        'هوشیار' ,'هاشم' ,'ابوذر' ,'حشمت' ,'سلمان' ,'سلیمان' ,'سلیم' ,'عزیز' ,'عزت' ,'عبید' ,'عابد' ,'افشار' ,
        'خاتم' ,'بامداد' ,'رامک' ,'مسعود' ,'عبدالباسط' ,'عبدالعلی' ,'عبدالرحمن' ,'عبدالرحیم' ,'عبدالسمیع' ,
        'عبدالشفیع' ,'قهار' ,'عبدالقهار' ,'مجتبی' ,'مصطفی' ,'محمدامین' ,'امین' ,'کیا' ,'خشایار' ,'حشمت' ,'آران' ,
        'آراس' ,'آریاس' ,'ماهیار'
            ],

        'female'=>[
            'آرمیتا','آتوسا','آناهیتا','آهو','آیدا','آرزو','آیه','السا','آتنا','آدینه','آذر','آبان','آرامیس',
            'آرشیدا','آنوشا','آرمیس','آسمان','آسنات','آسیه','آشتی','آشنا','آفاق','آفتاب','آلاله','آپادانا',
            'آویژه','ابرا','اسرا','اسما','اسوه','افروز','افسانه','اقدس','الاهه','النا','الناز','الهام',
            'الیکا','آماندا','الیکا','بتول','بدری','بشری','بنفشه','بنت الهدی','بهار','بهاره','بیتا','تینا',
            'باران','تارا','ترمه','ترنم','ترلان','ترانه','تسنیم','تلما','تمنا','تهمینه','توران','تیام','تیانا',
            'ثریا','ثمین','جسیکا','جمیله','جیران','حدیث','حریر','حمیرا','حسنی','حنا','حوا','حیات','خاتون',
            'خدیجه','خاور','خاتون','خجسته','خرم','خورشید','درسا','دریا','دلارام','دلبر','دلاوین','دلسا','دلربا',
            'دینا','دنیز','دنیا','رابعه','ربکا','راحله','راضیه','رافعه','رزیتا','رسپینا','رضوان','رعنا','رقیه',
            'رها','رودابه','رکسانا','روما','روناک','ریحانه','ریحانا','زهرا','زلیخا','زهره','زیبا','دیبا','زینب',
            'زیور','سحر','ساحر','ساحل','سارا','ساره','سرگل','سمانه','سعادت','سارینا','سلما','سانا','ساناز',
            'سبا','ستاره','ستوده','سروناز','سلنا','سمیه','سنا','سدنا','سهیلا','سیلا','سودا','سوده','سونیا','سولین',
            'سمیرا','سیدا','سکینه','سیمین','شیما','شراره','شبنم','شفق','شقایق','شمسه','شمین','شنیا','شهرزاد',
            'شهره','شهناز','شادی','شیدا','شکوه','شوکت','شیدا','شکیلا','شیلا','شیوا','صبا','صدف','صبری','صغرا','صنم',
            'صوفیا','طاهره','طوبی','طنین','طلوع','طلیعه','طهورا','طیبه','ظریف','عاطفه','عذرا','عسل','عفت',
            'غزل','غزال','غزاله','غنچه','فاطمه','فائقه','فائزه','فتانه','فخری','فرانک','فرح','فرحناز','فرخنده',
            'فرزانه','فرشته','فرنوش','فرناز','فروزان','فرنگیز','فرانک','فلورا','فلور','قمر','لاله','لادن','لارا',
            'لورا','لیا','لیلا','لیندا','مهسا','مهیا','مهلا','مارال','ماری','ماریا','مانا','ماندانا','ماهدیس','ماهرخ',
            'مهناز','مریم','ماهرو','مه لقا','مینا','مبینا','مهستی','محبوبه','محدثه','مدینه','مهنا','مریلا','ملودی',
            'مهتاب','مهدیه','مهرجان','مرجان','مهشید','مونا','مینو','نارین','ناتاشا','نسرین','نرمین','نرگس',
            'نازگل','نازیلا','ناهید','نجلا','نجمه','نوشین','نسیم','نسا','نسترن','نفس','نعیمه','نغمه','نقره','نقشین',
            'نهال','نورا','نوا','نگار','نگین','نگاه','نگارا','نیلو','نیلوفر','هاله','هانا','هما','هانی','هدی',
            'هایا','هانیه','هلن','هلنا','هلما','ویدا','ویشکا'
        ]
    ];
}